In [1]:
import pandas as pd

In [10]:
from datetime import date

data = pd.DataFrame({'date':
['01-01-2017',
'04-12-2008',
'23-06-1988',
'25-08-1999',
'20-02-1993',
]})

In [11]:
data.head(3)

         date
0  01-01-2017
1  04-12-2008
2  23-06-1988

In [12]:
data['date'] = pd.to_datetime(data.date)

In [13]:
data['Day of the Week'] = data['date'].dt.weekday

In [15]:
data['Week of the Year'] = data['date'].dt.weekofyear

In [17]:
data['Hour'] = data['date'].dt.hour

In [19]:
data['Minute'] = data['date'].dt.minute

In [25]:
data['Day of the Year'] = data['date'].dt.dayofyear

In [27]:
data['day_name'] = data['date'].dt.day_name()

In [29]:

data['Month_name'] = data['date'].dt.month_name()

In [31]:
data['passed_years'] = date.today().year - data['date'].dt.year

In [33]:
data['year'] = data['date'].dt.year

In [32]:
data.head(3)

,date,Day of the Week,Week of the Year,Hour,Minute,Day of the Year,day_name,Month_name,passed_years
0,2017-01-01,6,52,0,0,1,Sunday,January,2
1,2008-04-12,5,15,0,0,103,Saturday,April,11
2,1988-06-23,3,25,0,0,175,Thursday,June,31

In [10]:
#Transform string to date

data['date'] = pd.to_datetime(data.date, format="%d-%m-%Y")

In [13]:
#Extracting Year
data['year'] = data['date'].dt.year
data.head(3)

        date  year
0 2017-01-01  2017
1 2008-12-04  2008
2 1988-06-23  1988

In [17]:
#Extracting Month
data['month'] = data['date'].dt.month

#Extracting passed years since the date
data['passed_years'] = date.today().year - data['date'].dt.year

#Extracting passed months since the date
data['passed_months'] = (date.today().year - data['date'].dt.year) * 12 + date.today().month - data['date'].dt.month

#Extracting the weekday name of the date
data['day_name'] = data['date'].dt.day_name()
data.head(3)

,date,year,month,passed_years,passed_months,day_name,Name_of_the_day
0,2017-01-01,2017,1,2,32,Sunday,Sunday
1,2008-12-04,2008,12,11,129,Thursday,Thursday
2,1988-06-23,1988,6,31,375,Thursday,Thursday